run/tutorials/multiphase/interCondEvapPhaseChangeFoam/StefanProblem_totPressure/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    upDown
    {
	type	empty;	
    }
    right
    {
		type		zeroGradient;
    }	
    left
    {
	type            fixedValue;
        value           uniform (0 0 0);    
    }
    frontAndBack 
    {
	type	empty; 
    }

}

// ************************************************************************* //
