run/tutorials/multiphase/interCondEvapPhaseChangeFoam/StefanProblem_totPressure/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1E6;

boundaryField
{
    upDown
    {
		type	empty;
    }

    right
    {
        type            totalPressure;
        p0              $internalField;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           $internalField;
    }

    left
    {
		type            fixedFluxPressure;
        value           $internalField; 
    }

   frontAndBack 
   {
        type	empty; 
   }

}


// ************************************************************************* //
