run/tutorials/multiphase/interCondEvapPhaseChangeFoam/StefanProblem_totPressure/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
//    default         leastSquares;
    default         Gauss linear;
//    default         cellLimited fourth 0;
//    default         fourth;
}

divSchemes
{
    div(rhoPhi,U)  Gauss vanLeer;
//    div(phi,alpha)  Gauss vanLeer;
    div(phi,alpha)   Gauss interfaceCompression;
    div(phirb,alpha) Gauss vanLeer;
    div((muEff*dev(T(grad(U))))) Gauss linear;
	div(rhoPhiCpf,T) Gauss vanLeer;
	div(rhoPhi,T) Gauss vanLeer;
	div(phi,T) Gauss vanLeer;
	div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
//    default         limited corrected 0.5;
//    default         quadraticFit 3;
    default         orthogonal;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha.water;
}


// ************************************************************************* //
